# Exercise Set 3

Below are five problems, each worth 1 point. These problems are interleaved with short tutorials on Python. This assignment will be autograded to ensure a quick turnaround. After several of the problems, there are tests associated with your answer which will help you determine if you have solved the problem correctly. If you can run the cell after your answer and not get any errors, then you very likely have gotten the question right. If you have errors, hopefully the error will help you identify the mistake. However, for some questions that ask for information, the grading cell will not tell you whether or not you got it correct (there is no way to do so without giving away the answer). It will tell you whether or not your formatting is correct.

Note that just because you don't get errors on the questions that do check your answer doesn't mean that you got the question correct. I have some additional tests held back that I do not show here, though if you pass the ones shown, you will likely pass those as well.

When you are done with the assignment, you should save this notebook manually by clicking on the save button in the toolbar (the floppy disk icon). **Do not rely on autosave. Save manually!** Ensure that you have not renamed the file. **The autograder that is used to grade this notebook requires that the file be named `Exercise_III.ipynb`.** Once you save the notebook, follow the instructions in the `README.md` file to submit the assignment.

Finally, you are encouraged to add new cells as you go through the notebook and experiment. Any cell that should not be copied or deleted is marked as such. As long as you don't copy or delete the cells marked as such, then you should feel free to experiment as much as you would like with this notebook.

## Pandas DataFrames

In this exercise, we will primarily be looking at how to manipulate data within a pandas dataframe. Some of this you will have seen before in starter code, but hopefully you will develop a deeper understanding and appreciation for how to manipulate data in Python. First, we will import pandas and call it `pd` (giving us access to all of the pandas functions by writing `pd.FUNCTION`).

In [230]:
import pandas as pd

I am deeply indebted to open source material available at a few places. The list (not exhaustive) of sources is the following:

  1. [Python Pandas Tutorial: A Complete Introduction for Beginners](https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/). A large number of the examples was copied verbatim from here.
  2. [Pandas Exercises](https://github.com/guipsamora/pandas_exercises). A GitHub repository that provides a lot of examples around using Pandas. Some of the exercises were adapted from these examples, so do not use this as a resource until after submitting this and the next exercise sets.

## Problem Dataset - Chipotle Orders

In this assignment's questions, we are going to be analyzing some data from orders at Chipotle. You can read it in with the following cell. Notice the `sep = '\t'`. This is because the data set is tab seperated, not comma separated as we are used to.

In [231]:
chipo = pd.read_csv("chipotle.tsv", sep = '\t')

You should spend some time familiarizing yourself with the data.

In [232]:
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

This data set is broken up by `order_id` which corresponds to a particular order, and then within each order, there may be multiple items. The particular items are indicated by `item_name`, and any choices associated with those items are indicated by `choice_description` (e.g. the second item in `order_id=1` is an "Izze" drink with "Clementine" flavor). Additionally, there is the `item_price` for each order and the `quantity` of the item ordered. Be careful with the `item_price` as it is not the price for the item, it is the price for the time times the number of items ordered. You can see this in row 4 where `order_id=2` orders 2 chicken bowls for `$16.98`.

## DataFrame vs Series

Pandas has two different data structures with two slightly different purposes. The first is a "Series" which is just a column of data, and a DataFrame, which is a group of Series put together. The following picture illustrates the relationship.

<img src="images/series-and-dataframe.png" width="800"/>

In this notebook, we will primarily be concerned with DataFrames, but a lot of the same intuition and tools will carry over to working with Series as well.

## Creating DataFrames

Pandas is primarily centered around the concept of DataFrames, and it is useful to know how to create these. Let's start with a simple example. The easiest way to input data into a DataFrame is to start with a dictionary. This dictionary should have keys equal to the column names, and the values should be lists all of the same length with the data in them. Below we create a dictionary with data about apples and oranges. The keys would be "apples" and "oranges" and the data is the list that follows the keys.

In [233]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2]
}

Once we have our dictionary, we can create a DataFrame with the `pd.DataFrame()` function.

In [234]:
purchases = pd.DataFrame(data)

In [235]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

We see we have a DataFrame with the information about apples and oranges above. It is very easy to confirm the size of the `purchases` dataframe. We can use the following:

In [236]:
purchases.shape

(4, 2)

From `(4, 2)` we can see that we have four rows and two columns.

### Problem #1 - 1 point

How many rows are in the data set? How many columns? You should assign your answers to variables `chipotle_rows` and `chipotle_columns`. The grade cell will not tell you whether or not you are right. Your answer should look something like the below:
``` python
chipotle_rows = x
chipotle_columns = y
```
with x and y replaced with your answers (and not indented, obviously).

In [237]:
chipotle_rows = chipo.shape[0]
chipotle_columns = chipo.shape[1]
print("The number of rows is: " + str(chipotle_rows))
print("The number of columns is: " + str(chipotle_columns))

The number of rows is: 4622
The number of columns is: 5

In [238]:
# THIS IS A GRADING CELL. DO NOT EDIT AND DO NOT COPY.
# This cell will not tell you whether or not your answer is right.
# If you have not assigned an integer to the variables chipotle_rows
# and chipotle_columns, you will get an error, but if you just get the question wrong,
# you will not necessarily get an error.
from nose.tools import assert_equal, assert_true
import numpy as np
assert_true(isinstance(chipotle_rows, (int, np.integer)))
assert_true(isinstance(chipotle_columns, (int, np.integer)))
print("You have stated that the number of chipotle rows is: " + str(chipotle_rows))
print("You have stated that the number of chipotle columns is: " + str(chipotle_columns))

You have stated that the number of chipotle rows is: 4622
You have stated that the number of chipotle columns is: 5

We also have another column (the one on the far left) that is all numbers, starting from 0. This is the _index_ of the DataFrame, and it is the way in which a DataFrame keeps track of rows. We can set the index when we create the DataFrame in order to give more understandable labels. Suppose that our data was the purchase history of four customers from a fruit stand. We might label the rows by their names, so their names would become the index.

In [239]:
purchases_names = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])

In [240]:
purchases_names

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

Once we have this, we can access a **loc**ation in the DataFrame with a `.loc[]` command using the index.

In [241]:
purchases_names.loc["Lily"]

apples     0
oranges    7
Name: Lily, dtype: int64

In [242]:
purchases.loc[2]

apples     0
oranges    7
Name: 2, dtype: int64

Note that we can access the same data in either DataFrame, but `purchases_names` is probably a little easier to understand.

Okay, now that we have some data, it would be a shame to lose it. Let's write it to a csv.

In [243]:
purchases_names.to_csv("purchases.csv")

Note that we don't have to name the file anything specific. We can choose an arbitrary name.

Suppose we restart the notebook and we'd like to get back our DataFrame. We can read it back in.

In [244]:
purchases_names = pd.read_csv("purchases.csv")

Let's take a look at what we have.

In [245]:
purchases_names

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

It's not quite the same. When we write out the dataframe, it writes out the index as a column. When we read it in, it doesn't know that the first column is the index. We can make it the index though.

In [246]:
purchases_names.set_index("Unnamed: 0")

            apples  oranges
Unnamed: 0
June             3        0
Robert           2        3
Lily             0        7
David            1        2

Great! Let's take another look at our dataframe.

In [247]:
purchases_names

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

Wait! We had set the index, didn't we? It turns out that generally pandas doesn't do things "in place". You have to assign what you want to another variable in order to get it to "stick".

In [248]:
purchases_names = purchases_names.set_index("Unnamed: 0")

In [249]:
purchases_names

            apples  oranges
Unnamed: 0
June             3        0
Robert           2        3
Lily             0        7
David            1        2

That did the trick. However, we have an ugly name for the index. Let's fix that.

In [250]:
purchases_names.rename_axis('Customer')

          apples  oranges
Customer
June           3        0
Robert         2        3
Lily           0        7
David          1        2

Did that hold?

In [251]:
purchases_names

            apples  oranges
Unnamed: 0
June             3        0
Robert           2        3
Lily             0        7
David            1        2

Nope. We can often use the `inplace=True` variable instead of reassigning it. Let's see how that works.

In [252]:
purchases_names.rename_axis('Customer', inplace=True)

In [253]:
purchases_names

          apples  oranges
Customer
June           3        0
Robert         2        3
Lily           0        7
David          1        2

That did the trick.

However, sometimes it is more convenient to have a numeric index like `purchases` originally had. Let's go back to that.

In [254]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

We could create column with the customers instead of having them be part of the index.

In [255]:
purchases["Customer"] = ["June", "Robert", "Lily", "David"]

As you can see, we only had to name the new column and assign new values to it.

In [256]:
purchases

   apples  oranges Customer
0       3        0     June
1       2        3   Robert
2       0        7     Lily
3       1        2    David

Sometimes a dataframe is not entirely clean. It may have duplicate rows. While our dataframe does not have any duplicate rows, we can create some by concatenating rows that already exist. NOTE: the `.reset_index()` method just resets the numbering for the indices. Typically when you append existing rows of a dataframe, it keeps their old indices, so you end up with duplicate number of indices. It is not necessary to reset the index, but it looks a little nicer if you do. You should run the code without the `.reset_index()` to see what happens for yourself.

In [257]:
purchases = pd.concat([purchases, purchases.iloc[1:3]], axis=0).reset_index()

In [258]:
purchases

   index  apples  oranges Customer
0      0       3        0     June
1      1       2        3   Robert
2      2       0        7     Lily
3      3       1        2    David
4      1       2        3   Robert
5      2       0        7     Lily

We need a way to detect these duplicate rows. Fortunately, pandas has a built in `.duplicated()` method. This returns `True` for each row that is a duplicate of an earlier row.

In [259]:
purchases.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

We can see, as expected, that the last two rows are duplicates. This is easy to see for a small dataset like we have, but often you want to summarize information like this into something like "how many duplicate rows are there." A useful way to do this is with the `.sum()` function. For a list of boolean values, it will add up all of the `True` values, giving a count of how many duplicate rows there are.

In [260]:
purchases.duplicated().sum()

2

chipotle_duplicates = chipo.duplicated().sum()
### Problem #2 - 1 point

The chipotle dataset, `chipo`, is not particularly clean. There are a number of duplicated rows. How many rows are duplicates? You should not count the original row as a duplicate, i.e., if there is a row that has a duplicate, count it as one, not two. If there is a row that is duplicated three times, count it as two, not three, and so on. You should assign your answer to a variable called `chipotle_duplicates`, i.e. your answer should be of the form:
``` python
chipotle_duplicates = x
```
with x replaced with your answer (and not indented, obviously).

In [261]:
chipotle_duplicates = chipo.duplicated().sum()
print("The number of chipotle rows that are duplicated is: " + str(chipotle_duplicates))

The number of chipotle rows that are duplicated is: 59

In [262]:
# THIS IS A GRADING CELL. DO NOT EDIT AND DO NOT COPY.
# This cell will not tell you whether or not your answer is right.
# If you have not assigned an int to the variable chipotle_duplicates,
# you will get an error, but if you just get the question wrong,
# you will not necessarily get an error.
from nose.tools import assert_equal, assert_true
import numpy as np
print("You have stated that the number of chipotle rows that are duplicated is: " + str(chipotle_duplicates))
assert_true(isinstance(chipotle_duplicates, (int, np.integer)))

You have stated that the number of chipotle rows that are duplicated is: 59

After we have identified duplicates, it is natural to want to get rid of the duplicates. We can do this with the method `.drop_duplicates()`. We either have to use the `inplace=True` argument, or we need to assign the variable to another variable. See what happens when we don't:

In [263]:
purchases.drop_duplicates()

   index  apples  oranges Customer
0      0       3        0     June
1      1       2        3   Robert
2      2       0        7     Lily
3      3       1        2    David

However, when we display the `purchases` dataframe again:

In [264]:
purchases

   index  apples  oranges Customer
0      0       3        0     June
1      1       2        3   Robert
2      2       0        7     Lily
3      3       1        2    David
4      1       2        3   Robert
5      2       0        7     Lily

So, to make it stick, we do:

In [265]:
purchases = purchases.drop_duplicates()

In [266]:
purchases

   index  apples  oranges Customer
0      0       3        0     June
1      1       2        3   Robert
2      2       0        7     Lily
3      3       1        2    David

### Problem #3 - 1 point

Now that we know that the chipotle dataset, `chipo`, has duplicate rows, we need to get rid of them. Drop the duplicated rows. Don't forget to make sure that you either do it `inplace` or you save the result back to the original variable.

In [267]:
chipo.drop_duplicates(inplace=True)
chipo
# #### Note
#
# You may have noticed that the chipotle dataset, `chipo`, has duplicate rows. This is not a problem. The `.duplicated()` method will return `True` for each row that is a duplicate of an earlier row.
#

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [268]:
# THIS IS A GRADING CELL. DO NOT EDIT AND DO NOT COPY.
# This will give an error if your answer is wrong.
from nose.tools import assert_equal, assert_true
assert_equal(chipo.duplicated().sum(), 0)

Once we have a clean dataframe, we can start asking questions of it. One question might be, how many oranges, in total have been bought. Again, we can use the `.sum()` method.

In [269]:
purchases['oranges'].sum()

12

Examining the dataframe directly, we see that `12` is indeed correct:

In [270]:
purchases

   index  apples  oranges Customer
0      0       3        0     June
1      1       2        3   Robert
2      2       0        7     Lily
3      3       1        2    David

### Problem #4 - 1 point

How many items were ordered in total? You should assign your answers to the variable `total_ordered`. Remember, that a single row in the `chipo` dataframe can correspond to multiple items ordered (i.e. the `quantity` of the item may be more than one for each order). You should be summing up all of the items ordered. The grade cell will not tell you whether or not you are right. Your answer should look something like the below:
``` python
total_ordered = x
```
with x replaced with your answer as a number (and not indented, obviously).

In [271]:
total_ordered = chipo['quantity'].sum()
print("The total number of items ordered is: " + str(total_ordered))

The total number of items ordered is: 4913

In [272]:
# THIS IS A GRADING CELL. DO NOT EDIT AND DO NOT COPY.
# This cell will not tell you whether or not your answer is right.
# If you have not assigned an int to the variable total_ordered,
# you will get an error, but if you just get the question wrong,
# you will not necessarily get an error.
from nose.tools import assert_equal, assert_true
import numpy as np
print("You have stated that the number of items ordered is: " + str(total_ordered))
assert_true(isinstance(total_ordered, (int, np.integer)))

You have stated that the number of items ordered is: 4913

Often times, especially in feature engineering, we want to transform some portion of our data, which often means applying a function on each row of the data. For example, we might want to take all of our customer names and make them lowercase. We may need to do this if we are merging our dataset with another where the customer names are all lower case. This is very easy to do with DataFrames. First, we define the function. Then we `.apply()` it to the DataFrame.

In [273]:
def to_lowercase(x):
    return x.lower()

The above function will convert any string to lowercase. For example:

In [274]:
to_lowercase("Testing the Function!")

'testing the function!'

Now we create a new column called "lowercase_name" that has this value in it.

In [277]:
purchases.loc[:, "lowercase_name"] = purchases["Customer"].apply(to_lowercase)

In [278]:
purchases

   index  apples  oranges Customer lowercase_name
0      0       3        0     June           june
1      1       2        3   Robert         robert
2      2       0        7     Lily           lily
3      3       1        2    David          david

We can do this with any function that takes in the values from the columns and then transforms it.

### Problem #5 - 1 point

Create a new column called `item_price_number` that is a number for the item price. In the original data set, the item price is a string because it has a "$" on the front and a space in the back, so item price looks like `$12.45 `, instead of `12.45`. The item price also needs to be converted to a `float` type data. The below function named `price_to_float` will do the correct calculation for you, but you need to use the function correctly to assign the values to a new column called `item_price_number`. The grading cell will check to see if you have successfully assigned the right value.

In [279]:
def price_to_float(price):
    return float(price[1:-1])

In [280]:
chipo['item_price_number'] = chipo['item_price'].apply(price_to_float)
print(chipo.head())

   order_id  quantity                              item_name  \
0         1         1           Chips and Fresh Tomato Salsa
1         1         1                                   Izze
2         1         1                       Nantucket Nectar
3         1         1  Chips and Tomatillo-Green Chili Salsa
4         2         2                           Chicken Bowl

                                  choice_description item_price  \
0                                                NaN     $2.39
1                                       [Clementine]     $3.39
2                                            [Apple]     $3.39
3                                                NaN     $2.39
4  [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98

   item_price_number
0               2.39
1               3.39
2               3.39
3               2.39
4              16.98

In [281]:
from nose.tools import assert_equal
assert_equal(chipo.loc[4, 'item_price_number'], 16.98)
assert_equal(chipo.loc[27, 'item_price_number'], 8.99)
assert_equal(chipo.loc[29, 'item_price_number'], 8.49)